ShowSpatialElementCalculationPoint Property
 For families that can have a calculation point for spatial elements, hide or show the calculation point.  SpatialElementCalculationPoint  elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool ShowSpatialElementCalculationPoint { get; set; }
  Visual Basic
Public Property ShowSpatialElementCalculationPoint As Boolean
	Get
	Set
  Visual C++
public:
property bool ShowSpatialElementCalculationPoint {
	bool get ();
	void set (bool value);
}
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →